Revit 2015 API
FabricArea.GetCurveElementIds Method
 Retrieves the identifiers of the set of curves forming the boundary of the Fabric Area.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Autodesk Revit 2015. Call getBoundaryCurveIds instead.")]
public IList<ElementId> GetCurveElementIds()
Visual Basic
<ObsoleteAttribute("This method is obsolete in Autodesk Revit 2015. Call getBoundaryCurveIds instead.")> _
Public Function GetCurveElementIds As IList(Of ElementId)
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Autodesk Revit 2015. Call getBoundaryCurveIds instead.")]
public:
IList<ElementId^>^ GetCurveElementIds()
Return Value
 A collection of ElementIds of FabricAreaCurve elements.
Remarks
 Each ElementId in the collection is an Id of an Element of type CurveElem.
See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace